#▄─────────────────────────────────▄
#█                                 █
#█  Runner: Notice                 █
#█  • Уведомление (запуск команд)  █
#█                                 █
#▀─────────────────────────────────▀
runner:Notice() { case "$1" in
#┌─────────────────────────────────────────────────┐
#│ Проверяет задан-ли пароль от docker-репозитория │
#└─────────────────────────────────────────────────┘
    'no_docker_pass')
        [ -z "$DOCKER_PASS" ]
    ;;
    
#┌──────────────────────────────────────┐
#│ Проверяет устарела-ли текущая версия │
#└──────────────────────────────────────┘
    'no_current_version')
        [[ "$REPO_VERSION" != "$VERSION" ]]
    ;;
    
#┌────────────────────────────────────────┐
#│ Проверяет завершен-ли последний деплой │
#└────────────────────────────────────────┘
    'bad_deploy')
        [ -n "$LAST_SELECTION" ]
    ;;
    
#┌────────────────────────────────────────────────┐
#│ Проверяет проходит-ли валидацию текущая версия │
#└────────────────────────────────────────────────┘
    'no_valid_version')
        ! isValidVersion "$VERSION"
    ;;
esac
}
