#▄──────────────────────────────▄
#█                              █
#█  Runner: SSH                 █
#█  • SSH-ключ (запуск команд)  █
#█                              █
#▀──────────────────────────────▀
runner:SSH() { case "$1" in
#┌───────────────────────┐
#│ Проверяет SSH-каталог │
#└───────────────────────┘
    'check_dir')
    # Создаем каталог (только если его нет)
        mkdir -p "$PATH_CURRENT/$SSH_DIR"
    ;;
    
#┌────────────────────┐
#│ Проверяет SSH-ключ │
#└────────────────────┘
    'check_key')
        ! is_exists "$PATH_CURRENT/$SSH_DIR/$NEW_SSH_KEY"
    ;;
    
#┌────────────────────────┐
#│ Создает новый SSH-ключ │
#└────────────────────────┘
    'ssh_keygen')
        ssh-keygen -t 'rsa' -N '' -C '' -f "$PATH_CURRENT/$SSH_DIR/$NEW_SSH_KEY"
    ;;
esac
}
