#▄───────────────────────────▄
#█                           █
#█  View: Settings           █
#█  • Настройки (интерфейс)  █
#█                           █
#▀───────────────────────────▀
view:Settings() { case "$1" in
#┌─────────────────┐
#│ Пароль не задан │
#└─────────────────┘
    'empty_pass')
        DOCKER_PASS_HIDDEN='<пароль не задан>'
    ;;
    
#┌──────────────────────────────────────────┐
#│ Выводит сообщение об успешном завершении │
#└──────────────────────────────────────────┘
    'success') case "$2" in
    # Git-репозиторий
        'save_git') view 'success' \
            'Данные для git-репозитория успешно сохранены!' \
            "Имя юзера:       '$GIT_USER'" \
            "Имя репозитория: '$GIT_REPO'"
        ;;
        
    # Docker-репозиторий
        'save_docker') view 'success' \
            'Данные для docker-репозитория успешно сохранены!' \
            "Логин:  '$DOCKER_USER'" \
            "Пароль: '$DOCKER_PASS_HIDDEN'"
        ;;
    esac
    ;;
esac
}
