#▄───────────────────────────────────▄
#█                                   █
#█  Список информационных сообщений  █
#█                                   █
#▀───────────────────────────────────▀
INFO_LIST=(
    'run' # Проверяет запущен-ли контейнер
)

#▄─────────────────────────▄
#█                         █
#█  Список предупреждений  █
#█                         █
#▀─────────────────────────▀
WARNING_LIST=(
    'run_old'   # Проверяет запущен-ли старый контейнер
    'dir_empty' # Проверяет текущий каталог
)

#▄─────────────────▄
#█                 █
#█  Список ошибок  █
#█                 █
#▀─────────────────▀
ERROR_LIST=(
    'dir_error' # Проверяет локальный репозиторий
)

#▄───────────────────────────▄
#█                           █
#█  Список фатальных ошибок  █
#█                           █
#▀───────────────────────────▀
FATAL_LIST=(
    'bad_cd' # Проверяет задана-ли переменная '$CD'
)

#▄─────────────────────────────▄
#█                             █
#█  View: Notice               █
#█  • Уведомление (интерфейс)  █
#█                             █
#▀─────────────────────────────▀
view:Notice() { case "$1" in
#┌─────────────────────────────────┐
#│ Список информационных сообщений │
#└─────────────────────────────────┘
    'info') case "$2" in
        'run') info "Контейнер '$RUN_IMAGE:$RUN_VERSION' уже запущен!" "http://localhost:$RUN_PORT/" ;;
    esac
    ;;
    
#┌───────────────────────┐
#│ Список предупреждений │
#└───────────────────────┘
    'warning') case "$2" in
        'run_old')   warning "Контейнер '$RUN_IMAGE:$RUN_VERSION' устарел!" "Новая версия: '$VERSION'" ;;
        'dir_empty') warning 'Вам необходим локальный репозиторий!'         "Нажмите 'Git clone'"      ;;
    esac
    ;;
    
#┌───────────────┐
#│ Список ошибок │
#└───────────────┘
    'error') case "$2" in
        'dir_error') error 'Каталог должен быть пуст!' "Путь: $CD" ;;
    esac
    ;;
    
#┌─────────────────────────┐
#│ Список фатальных ошибок │
#└─────────────────────────┘
    'fatal_error') case "$2" in
        'bad_cd') fatal_error "Переменная окружения '\$CD' не задана!" ;;
    esac
    ;;
esac
}
