#▄─────────────────────────────────▄
#█                                 █
#█  Runner: Notice                 █
#█  • Уведомление (запуск команд)  █
#█                                 █
#▀─────────────────────────────────▀
runner:Notice() { case "$1" in
#┌────────────────────────────────┐
#│ Проверяет запущен-ли контейнер │
#└────────────────────────────────┘
    'run')
        [ -n "$RUN_IMAGE" ]
    ;;
    
#┌───────────────────────────────────────┐
#│ Проверяет запущен-ли старый контейнер │
#└───────────────────────────────────────┘
    'run_old')
        [[ -n "$RUN_IMAGE" && "$RUN_VERSION" != "$VERSION" ]]
    ;;
    
#┌───────────────────────────────────┐
#│ Проверяет пуст-ли текущий каталог │
#└───────────────────────────────────┘
    'current_dir_is_empty')
        controller:Request 'current_dir_is_empty'
    ;;
    
#┌─────────────────────────────────────────────────┐
#│ Проверяет существует-ли каталог с именем ".git" │
#└─────────────────────────────────────────────────┘
    'bad_git')
        controller:Request 'bad_git'
    ;;
    
#┌──────────────────────────────────────┐
#│ Проверяет задана-ли переменная '$CD' │
#└──────────────────────────────────────┘
    'bad_cd')
        [ -z "$CD" ]
    ;;
esac
}
