#▄─────────────────────────────────▄
#█                                 █
#█  Entrypoint: Edit               █
#█  • Редактировать (точка входа)  █
#█                                 █
#▀─────────────────────────────────▀
entrypoint:Edit() { nav:Init; while :; do
#┌────────────────────────┐
#│ Уведомления об ошибках │
#└────────────────────────┘
    if notice 'error'; then
    # Предлагаем пользователю исправить ошибку
        navigator 'error'
        
#┌───────────────────┐
#│ Ошибок не найдено │
#└───────────────────┘
    else
        nav:Main # Выводим меню на экран
    fi
done
}
