#▄────────────────────────▄
#█                        █
#█  Entrypoint: Menu      █
#█  • Меню (точка входа)  █
#█                        █
#▀────────────────────────▀
entrypoint:Menu() { view 'init'; while :; do
#┌────────────────────────┐
#│ Уведомления об ошибках │
#└────────────────────────┘
    if notice 'error'; then
    # Предлагаем пользователю исправить ошибку
        view:Menu 'error'
        
#┌───────────────────┐
#│ Ошибок не найдено │
#└───────────────────┘
    else
        menu:Main # Выводим меню на экран
    fi
done
}
