#▄─────────────────────────────────▄
#█                                 █
#█  Runner: Notice                 █
#█  • Уведомление (запуск команд)  █
#█                                 █
#▀─────────────────────────────────▀
runner:Notice() { case "$1" in
#┌────────────────────────────────┐
#│ Проверяет хэш текущего коммита │
#└────────────────────────────────┘
    'bad_commit')
    # Сохраняем хэш
        CURRENT_COMMIT="$(git rev-parse HEAD 2> '/dev/null')"
        
    # Проверяем хэш
        [ -z "$CURRENT_COMMIT" ]
    ;;
    
#┌─────────────────────────────────────┐
#│ Проверяет находитя-ли HEAD на ветке │
#└─────────────────────────────────────┘
    'bad_branch')
        [ -z "$(git branch --show-current 2> '/dev/null')" ]
    ;;
esac
}
