#▄──────────────────────────▄
#█                          █
#█  Model: Notice           █
#█  • Уведомление (логика)  █
#█                          █
#▀──────────────────────────▀
model:Notice() { case "$1" in
#┌─────────────────────────────────┐
#│ Проверяет список предупреждений │
#└─────────────────────────────────┘
    'warning')
        model:Notice 'run_list' "${WARNING_LIST[@]}"
    ;;
    
#┌─────────────────────────┐
#│ Проверяет список ошибок │
#└─────────────────────────┘
    'error')
        model:Notice 'run_list' "${ERROR_LIST[@]}"
    ;;
    
#┌───────────────────────────────────┐
#│ Проверяет список фатальных ошибок │
#└───────────────────────────────────┘
    'fatal_error')
        model:Notice 'run_list' "${FATAL_LIST[@]}"
    ;;
    
#┌─────────────────────────┐
#│ Выполняет список команд │
#└─────────────────────────┘
    'run_list')
    # Локальные переменные
        local i
        
    # Проходим по списку команд
        for ((i = 2; i <= $#; i++)); do
        # Выполняем команду
            if model:Notice "${!i}"; then
            # Выводим уведомление
                view:Notice "${!i}"
            fi
        done
    ;;
    
#┌─────────────────────────────────────────────────┐
#│ Проверяет задан-ли пароль от docker-репозитория │
#└─────────────────────────────────────────────────┘
    'no_docker_pass')
        [ -z "$DOCKER_PASS" ]
    ;;
    
#┌──────────────────────────────────────┐
#│ Проверяет устарела-ли текущая версия │
#└──────────────────────────────────────┘
    'no_current_version')
        [[ "$REPO_VERSION" != "$VERSION" ]]
    ;;
    
#┌────────────────────────────────────────┐
#│ Проверяет завершен-ли последний деплой │
#└────────────────────────────────────────┘
    'bad_last_deploy')
        [ -n "$LAST_SELECTION" ]
    ;;
    
#┌────────────────────────────────────────────────┐
#│ Проверяет проходит-ли валидацию текущая версия │
#└────────────────────────────────────────────────┘
    'no_valid_version')
        ! isValidVersion "$VERSION"
    ;;
esac
}
