#▄──────────────────────────▄
#█                          █
#█  Model: Notice           █
#█  • Уведомление (логика)  █
#█                          █
#▀──────────────────────────▀
model:Notice() { case "$1" in
#┌─────────────────────────────────┐
#│ Проверяет список предупреждений │
#└─────────────────────────────────┘
    'warning')
        model:Notice 'run_list' "${WARNING_LIST[@]}"
    ;;
    
#┌───────────────────────────────────┐
#│ Проверяет список фатальных ошибок │
#└───────────────────────────────────┘
    'fatal_error')
        model:Notice 'run_list' "${FATAL_LIST[@]}"
    ;;
    
#┌─────────────────────────┐
#│ Выполняет список команд │
#└─────────────────────────┘
    'run_list')
    # Локальные переменные
        local i
        
    # Проходим по списку команд
        for ((i = 2; i <= $#; i++)); do
        # Выполняем команду
            if controller:Run "${!i}"; then
            # Выводим уведомление
                view:Notice "${!i}"
            fi
        done
    ;;
esac
}
