#▄──────────────────────────▄
#█                          █
#█  Model: Notice           █
#█  • Уведомление (логика)  █
#█                          █
#▀──────────────────────────▀
model:Notice() { case "$1" in
#┌───────────────────────────────────────┐
#│ Проверяет запущен-ли старый контейнер │
#└───────────────────────────────────────┘
    'run_old')
        [[ -n "$RUN_IMAGE" && "$RUN_VERSION" != "$VERSION" ]]
    ;;
    
#┌────────────────────────────────┐
#│ Проверяет запущен-ли контейнер │
#└────────────────────────────────┘
    'run')
        [ -n "$RUN_IMAGE" ]
    ;;
    
#┌──────────────────────────────────────┐
#│ Проверяет задана-ли переменная '$CD' │
#└──────────────────────────────────────┘
    'no_cd')
        [ -z "$CD" ]
    ;;
esac
}
