#▄────────────────────────────────▄
#█                                █
#█  Model: Request                █
#█  • Внутренний запрос (логика)  █
#█                                █
#▀────────────────────────────────▀
#┌────────────────────────────┐
#│ Передает внутренний запрос │
#└────────────────────────────┘
model:Request() {
# Имя текущего образа
    local image="$IMAGE_API:$VERSION"
    
# Имя текущего образа для тестирования
    if [[ "$IMAGE_DEV" != '' ]]; then
        image="$IMAGE_DEV"
    fi
    
# Передаем внутренний запрос
    docker run \
        -v "$DOCKER_PWD:$CURRENT_PATH" \
        --rm -it \
        "$image" \
        'API' \
        "$@" 2>&1
}
