#▄──────────────────────────▄
#█                          █
#█  Model: Notice           █
#█  • Уведомление (логика)  █
#█                          █
#▀──────────────────────────▀
model:Notice() { case "$1" in
#┌───────────────────────────────────────────┐
#│ Проверяет список информационных сообщений │
#└───────────────────────────────────────────┘
    'info')
        model:Notice 'run_list' "${INFO_LIST[@]}"
    ;;
    
#┌─────────────────────────────────┐
#│ Проверяет список предупреждений │
#└─────────────────────────────────┘
    'warning')
        model:Notice 'run_list' "${WARNING_LIST[@]}"
    ;;
    
#┌───────────────────────────────────┐
#│ Проверяет список фатальных ошибок │
#└───────────────────────────────────┘
    'fatal_error')
        model:Notice 'run_list' "${FATAL_LIST[@]}"
    ;;
    
#┌─────────────────────────┐
#│ Выполняет список команд │
#└─────────────────────────┘
    'run_list')
    # Локальные переменные
        local i
        
    # Проходим по списку команд
        for ((i = 2; i <= $#; i++)); do
        # Выполняем команду
            if model:Notice "${!i}"; then
            # Выводим уведомление
                view:Notice "${!i}"
            fi
        done
    ;;
    
#┌───────────────────────────────────────┐
#│ Проверяет запущен-ли старый контейнер │
#└───────────────────────────────────────┘
    'run_old')
        [[ -n "$RUN_IMAGE" && "$RUN_VERSION" != "$VERSION" ]]
    ;;
    
#┌────────────────────────────────┐
#│ Проверяет запущен-ли контейнер │
#└────────────────────────────────┘
    'run')
        [ -n "$RUN_IMAGE" ]
    ;;
    
#┌──────────────────────────────────────┐
#│ Проверяет задана-ли переменная '$CD' │
#└──────────────────────────────────────┘
    'no_cd')
        [ -z "$CD" ]
    ;;
esac
}
